In [3]:
# Data Cleaning and Preparation Tutorial
#In this tutorial, we will learn how to clean and prepare data for analysis using Python and pandas. Data cleaning is an essential step in data science, as it ensures the accuracy and usability of the data.

# 1. Handling Missing Data

In [38]:
import pandas as pd
import numpy as np

# Sample data with missing values
data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', None],
    'Age': [25, np.nan, 35, 45, 50],
    'Salary': [50000, 60000, np.nan, 80000, None]
})

print(data)

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  35.0      NaN
3    David  45.0  80000.0
4     None  50.0      NaN

*Explanation*: The above code creates a DataFrame with missing values represented by `NaN` for numeric columns (`Age`, `Salary`) and `None` for the object column (`Name`).

In [7]:
# Identifying missing data
print(data.isna())

    Name    Age  Salary
0  False  False   False
1  False   True   False
2  False  False    True
3  False  False   False
4   True  False    True

**Explanation:** The `isna()` method returns a DataFrame of the same shape as `data` with `True` indicating where missing values are present and `False` otherwise.

In [8]:
# Filling missing data with column mean
data['Age'] = data['Age'].fillna(data['Age'].mean())
data['Salary'] = data['Salary'].fillna(data['Salary'].mean())
print(data)

      Name    Age        Salary
0    Alice  25.00  50000.000000
1      Bob  38.75  60000.000000
2  Charlie  35.00  63333.333333
3    David  45.00  80000.000000
4     None  50.00  63333.333333

**Explanation:** The missing values in the `Age` and `Salary` columns are replaced with the mean of their respective columns using `fillna()`.

In [9]:
# Removing rows with missing data
cleaned_data = data.dropna()
print(cleaned_data)

      Name    Age        Salary
0    Alice  25.00  50000.000000
1      Bob  38.75  60000.000000
2  Charlie  35.00  63333.333333
3    David  45.00  80000.000000

**Explanation:** The `dropna()` method removes any rows containing missing data.

In [10]:
print(data)

      Name    Age        Salary
0    Alice  25.00  50000.000000
1      Bob  38.75  60000.000000
2  Charlie  35.00  63333.333333
3    David  45.00  80000.000000
4     None  50.00  63333.333333

In [11]:
import pandas as pd

# Sample DataFrame with duplicate entries
data = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "Alice", "David", "Charlie", "Eve"],
    "Age": [25, 30, 35, 25, 45, 35, 28],
    "Score": [85, 95, 70, 85, 88, 70, 92]
})
print(data)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     95
2  Charlie   35     70
3    Alice   25     85
4    David   45     88
5  Charlie   35     70
6      Eve   28     92

This DataFrame has some duplicate rows, specifically rows with "Alice" and "Charlie" that appear twice.

In [12]:
# Identify duplicated rows
duplicates = data.duplicated()
print(duplicates)

0    False
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool

The duplicated() method returns a Boolean Series indicating whether each row is a duplicate or not.

In [13]:
# Drop duplicate rows
data_no_duplicates = data.drop_duplicates()
print(data_no_duplicates)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     95
2  Charlie   35     70
4    David   45     88
6      Eve   28     92

In [15]:
print(duplicates)

0    False
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool

In [16]:
# Drop duplicates based only on the 'Name' column
data_unique_names = data.drop_duplicates(subset=["Name"])
print(data_unique_names)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     95
2  Charlie   35     70
4    David   45     88
6      Eve   28     92

This example drops duplicates based only on the "Name" column. It retains the first occurrence of each unique "Name".

In [17]:
# Sample data for transforming using a function or mapping
data = pd.DataFrame({
    "fruit": ["apple", "banana", "cherry", "banana", "apple", "cherry"],
    "price": [1.2, 0.5, 2.5, 0.5, 1.2, 2.5]
})
print(data)

    fruit  price
0   apple    1.2
1  banana    0.5
2  cherry    2.5
3  banana    0.5
4   apple    1.2
5  cherry    2.5

This DataFrame contains information about different fruits and their prices.

In [18]:
# Define a mapping from fruit to color
fruit_to_color = {
    "apple": "red",
    "banana": "yellow",
    "cherry": "red"
}

# Use the map method to apply this mapping
data["color"] = data["fruit"].map(fruit_to_color)
print(data)

    fruit  price   color
0   apple    1.2     red
1  banana    0.5  yellow
2  cherry    2.5     red
3  banana    0.5  yellow
4   apple    1.2     red
5  cherry    2.5     red

The map() method is used to transform each value in the "fruit" column based on the fruit_to_color dictionary.

In [42]:
# Sample Series with placeholder values
data = pd.Series([100, -999, 150, -999, 200, -1000, 250])
print(data)

0     100
1    -999
2     150
3    -999
4     200
5   -1000
6     250
dtype: int64

This Series contains some placeholder values (-999, -1000) that we want to replace with meaningful values.

In [43]:
# Replace placeholder values with NaN
data_replaced = data.replace([-999, -1000], [pd.NA, 0])
print(data_replaced)

0     100
1    <NA>
2     150
3    <NA>
4     200
5       0
6     250
dtype: object

The replace() method allows replacing multiple values with different replacements. Here, -999 is replaced by <NA> (missing value), and -1000 is replaced with 0.

In [44]:
# Replace placeholder values with NaN and 0 directly in the original data
data.replace([-999, -1000], [pd.NA, 0]), #inplace=True)
print("\nData After In-place Replacement:")
print(data)

Data After In-place Replacement:
0     100
1    -999
2     150
3    -999
4     200
5   -1000
6     250
dtype: int64

Explanation:
Using inplace=True in the replace() method directly modifies the original data Series, so when you print data again, the changes are reflected.
The replace() method changes the -999 values to <NA> (missing) and the -1000 value to 0 without needing to assign the result to a new variable.
Other Methods to Modify Data in Place
Apart from replace(), here are a few other common methods in pandas that support the inplace parameter:

fillna(): Fills missing values with a specified value.

In [29]:
# Example of dropping missing values in place, drop_duplicates(): Removes duplicate rows.


data.dropna(inplace=True)
print("\nData After In-place Drop:")
print(data)

Data After In-place Drop:
0    100
1    999
2    150
3    999
4    200
5      0
6    250
dtype: int64

In [25]:
# Example of filling missing values in place
data.fillna(999, inplace=True)
print("\nData After In-place Fill:")
print(data)

Data After In-place Fill:
0    100
1    999
2    150
3    999
4    200
5      0
6    250
dtype: int64

Data After In-place Drop:
0    100
1    999
2    150
3    999
4    200
5      0
6    250
dtype: int64

In [8]:
# Filling missing data with column mean
data['Age'] = data['Age'].fillna(data['Age'].mean())
data['Salary'] = data['Salary'].fillna(data['Salary'].mean())
print(data)

      Name    Age        Salary
0    Alice  25.00  50000.000000
1      Bob  38.75  60000.000000
2  Charlie  35.00  63333.333333
3    David  45.00  80000.000000
4     None  50.00  63333.333333

In [40]:
# Replace placeholder values with NaN
data_replace = data.replace([-999, -1000], [pd.NA, 0])
print(data_replaced)

0     100
1    <NA>
2     150
3    <NA>
4     200
5       0
6     250
dtype: object

In [36]:
# Example of dropping missing values in place
data_replace.dropna
print("\nData After In-place Drop:")
print(data_replace)

0    100
1    999
2    150
3    999
4    200
5      0
6    250
dtype: int64

In [39]:
# Example of sorting values in place
data.sort_values # (inplace=True)
print("\nData After In-place Sorting:")
print(data)

Data After In-place Sorting:
      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  35.0      NaN
3    David  45.0  80000.0
4     None  50.0      NaN

In [50]:
import pandas as pd
import numpy as np

# Creating a new DataFrame
data = pd.DataFrame(
    np.arange(16).reshape((4, 4)),
    index=["Berlin", "Tokyo", "Paris", "London"],
    columns=["alpha", "beta", "gamma", "delta"]
)
print("Original DataFrame:")
print(data)

Original DataFrame:
        alpha  beta  gamma  delta
Berlin      0     1      2      3
Tokyo       4     5      6      7
Paris       8     9     10     11
London     12    13     14     15

In [51]:
# Defining a transformation function
def transform(x):
    return x[:3].upper()

# Applying the map method to transform the index
data.index = data.index.map(transform)
print("\nTransformed Index using map:")
print(data)

Transformed Index using map:
     alpha  beta  gamma  delta
BER      0     1      2      3
TOK      4     5      6      7
PAR      8     9     10     11
LON     12    13     14     15

In [52]:
# Using rename to change index and column names
data_renamed = data.rename(index=str.title, columns=str.capitalize)
print("\nDataFrame After Using rename:")
print(data_renamed)

DataFrame After Using rename:
     Alpha  Beta  Gamma  Delta
Ber      0     1      2      3
Tok      4     5      6      7
Par      8     9     10     11
Lon     12    13     14     15

In [53]:
# Renaming a subset using a dictionary
data_subset_renamed = data.rename(index={"BER": "ROME"}, columns={"gamma": "theta"})
print("\nDataFrame After Renaming a Subset with Dictionary:")
print(data_subset_renamed)

DataFrame After Renaming a Subset with Dictionary:
      alpha  beta  theta  delta
ROME      0     1      2      3
TOK       4     5      6      7
PAR       8     9     10     11
LON      12    13     14     15